howto/warmup/ab--200u--10i1c.log
Mon Jun 23 19:17:13 ICT 2014
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking www.ramvark.net (be patient)


Server Software:        nginx/1.4.2
Server Hostname:        www.ramvark.net
Server Port:            80

Document Path:          /
Document Length:        1583 bytes

Concurrency Level:      200
Time taken for tests:   30.005 seconds
Complete requests:      2300
Failed requests:        0
Write errors:           0
Total transferred:      4163130 bytes
HTML transferred:       3652841 bytes
Requests per second:    76.65 [#/sec] (mean)
Time per request:       2609.112 [ms] (mean)
Time per request:       13.046 [ms] (mean, across all concurrent requests)
Transfer rate:          135.50 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      278  537 889.4    328   22143
Processing:   281 1243 2652.2    335   28417
Waiting:      281 1211 2592.2    334   28417
Total:        569 1780 2869.7    669   29002

Percentage of the requests served within a certain time (ms)
  50%    669
  66%   1788
  75%   1870
  80%   1925
  90%   3049
  95%   6330
  98%  12465
  99%  16502
 100%  29002 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking www.ramvark.net (be patient)
Total of 128 requests completed
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking www.ramvark.net (be patient)


Server Software:        nginx/1.4.2
Server Hostname:        www.ramvark.net
Server Port:            80

Document Path:          /typealine
Document Length:        526 bytes

Concurrency Level:      200
Time taken for tests:   30.002 seconds
Complete requests:      1948
Failed requests:        0
Write errors:           0
Total transferred:      1575060 bytes
HTML transferred:       1025700 bytes
Requests per second:    64.93 [#/sec] (mean)
Time per request:       3080.238 [ms] (mean)
Time per request:       15.401 [ms] (mean, across all concurrent requests)
Transfer rate:          51.27 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      283  520 770.7    332   12500
Processing:   286 1291 2730.1    347   28896
Waiting:      280 1203 2503.6    344   28896
Total:        572 1811 2885.6    703   29477

Percentage of the requests served within a certain time (ms)
  50%    703
  66%   1021
  75%   1888
  80%   1966
  90%   3237
  95%   6352
  98%  14352
  99%  15555
 100%  29477 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking www.ramvark.net (be patient)
Mon Jun 23 19:18:42 ICT 2014